app/controllers/todo_lists_controller.rb

  def index
    @todo_lists = TodoList.where(user: current_user)
---
SELECT "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."user_id" = $1  [["user_id", 1]]

  def create
    @todo_list = TodoList.new(todo_list_params)
    @todo_list.user = current_user

    respond_to do |format|
      if @todo_list.save
---
INSERT INTO "todo_lists" ("title", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Test#1"], ["description", "TESTING"], ["created_at", "2019-07-17 03:30:57.345573"], ["updated_at", "2019-07-17 03:30:57.345573"], ["user_id", 1]]

  def update
    respond_to do |format|
      if @todo_list.update(todo_list_params)
---
UPDATE "todo_lists" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "todo_lists"."id" = $4  [["title", "List#1"], ["description", "some description"], ["updated_at", "2019-07-21 07:54:29.474539"], ["id", 92]]