app/controllers/todo_items_controller.rb

INSERT INTO "todo_items" ("content", "todo_list_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "test"], ["todo_list_id", 1], ["created_at", "2019-07-17 03:31:01.251365"], ["updated_at", "2019-07-17 03:31:01.251365"]]
---
    def create
        @todo_item = @todo_list.todo_items.create(todo_item_params)